In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

In [7]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [9]:
df.describe()

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [11]:
df['remote_ratio'].value_counts()

0      105312
100     27718
50        319
Name: remote_ratio, dtype: int64

In [13]:
linhas, colunas = df.shape[0], df.shape[1]
print(f'Número de linhas: {linhas}')
print(f'Número de colunas: {colunas}')

Número de linhas: 133349
Número de colunas: 11

In [14]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

# Renomeeando as colunas

In [15]:
novos_nomes = {
    'work_year': 'ano',
    'experience_level': 'senioridade',
    'employment_type': 'contrato',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_currency': 'moeda',
    'salary_in_usd': 'usd',
    'employee_residence': 'residencia',
    'remote_ratio': 'remoto',
    'company_location': 'empresa',
    'company_size': 'tamanho_empresa'
}

df.rename(columns=novos_nomes, inplace=True)

df.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

# Usando value.counts() para analisar os dados

## Nível de senioridade

In [19]:
df['senioridade'].value_counts()

# SE - Senior
# MI - Mid, nível intermediário, Pleno
# EN - Entry, Junior
# EX - Executivo

SE    77241
MI    40465
EN    12443
EX     3200
Name: senioridade, dtype: int64

## Tipo de contrato

In [20]:
df['contrato'].value_counts()

FT - Full-time - Tempo integral – trabalho padrão de 40h/semana ou período completo
PT - Part-time - Meio período – carga horária reduzida
CT - Contract - Contrato temporário ou por projeto – geralmente por prazo determinado
FL - Freelance

FT    132563
CT       394
PT       376
FL        16
Name: contrato, dtype: int64

## Regime de trabalho

In [21]:
df['remoto'].value_counts()

0      105312
100     27718
50        319
Name: remoto, dtype: int64

## Tamanho da empresa

In [22]:
df['tamanho_empresa'].value_counts()

M    129561
L      3574
S       214
Name: tamanho_empresa, dtype: int64

# Modificando o nome das categorias:

In [23]:
senioridade = {
    'SE': 'senior',
    'MI': 'pleno',
    'EN': 'junior',
    'EX': 'executivo'
}

df['senioridade'] = df['senioridade'].replace(senioridade)
df['senioridade'].value_counts()

senior       77241
pleno        40465
junior       12443
executivo     3200
Name: senioridade, dtype: int64

In [24]:
contrato = {
    'FT': 'integral',
    'PT': 'parcial',
    'CT': 'contrato',
    'FL': 'freelancer'
}

df['contrato'] = df['contrato'].replace(contrato)
df['contrato'].value_counts()

integral      132563
contrato         394
parcial          376
freelancer        16
Name: contrato, dtype: int64

In [25]:
tamanho_da_empresa = {
    'L': 'grande',
    'S': 'pequena',
    'M': 'media'
}

df['tamanho_empresa'] = df['tamanho_empresa'].replace(tamanho_da_empresa)
df['tamanho_empresa'].value_counts()

media      129561
grande       3574
pequena       214
Name: tamanho_empresa, dtype: int64

In [26]:
trabalho_remoto = {
     0: 'presencial',
    100: 'remoto',
    50: 'hibrido'
}

df['remoto'] = df['remoto'].replace(trabalho_remoto)
df['remoto'].value_counts()

presencial    105312
remoto         27718
hibrido          319
Name: remoto, dtype: int64

In [27]:
df.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,senior,integral,Solutions Engineer,214000,USD,214000,US,remoto,US,media
1,2025.0,senior,integral,Solutions Engineer,136000,USD,136000,US,remoto,US,media
2,2025.0,pleno,integral,Data Engineer,158800,USD,158800,AU,presencial,AU,media
3,2025.0,pleno,integral,Data Engineer,139200,USD,139200,AU,presencial,AU,media
4,2025.0,junior,integral,Data Engineer,90000,USD,90000,US,presencial,US,media

In [28]:
# Estatística com objetos. Não são inteiros!
df.describe(include='object')

,senioridade,contrato,cargo,moeda,residencia,remoto,empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,senior,integral,Data Scientist,USD,US,presencial,US,media
freq,77241,132563,17314,126140,119579,105312,119641,129561

In [29]:
df['cargo'].value_counts()

Data Scientist               17314
Software Engineer            15007
Data Engineer                14868
Data Analyst                 12381
Engineer                      9456
                             ...
Platform Data Engineer           1
AI Engineering Lead              1
Advanced Data Analyst            1
Business Insights Manager        1
Marketing Data Scientist         1
Name: cargo, Length: 390, dtype: int64

Com isso já conseguimos responder algumas perguntas, como:

- Qual o nível de experiência mais comum na base de dados?

- Qual é o tipo de contrato mais frequente?

- Qual o cargo mais frequente na amostra?

- De qual país são a maioria dos profissionais da base?

- Qual é o país onde mais empresas da amostra estão sediadas?

- Qual o regime de trabalho mais comum?

- Qual é o tamanho mais comum das empresas na amostra?

In [35]:
# Qual o nível de experiência mais comum na base de dados?
df['senioridade'].value_counts().index[0]

'senior'

In [36]:
# Qual é o tipo de contrato mais frequente?
df['contrato'].value_counts().index[0]

'integral'

In [37]:
# Qual o cargo mais frequente na amostra?
df['cargo'].value_counts().index[0]

'Data Scientist'

In [38]:
# De qual país são a maioria dos profissionais da base?
df['residencia'].value_counts().index[0]

'US'

In [39]:
# Qual é o país onde mais empresas da amostra estão sediadas?
df['empresa'].value_counts().index[0]

'US'

In [40]:
# Qual o regime de trabalho mais comum?
df['remoto'].value_counts().index[0]

'presencial'

In [41]:
# Qual é o tamanho mais comum das empresas na amostra?
df['tamanho_empresa'].value_counts().index[0]

'media'